renesas/amazon-freertos/vendors/renesas/boards/rx671-rsk/ports/pkcs11/core_pkcs11_pal.c
            data_flash_update_status_initialize();
            while ( update_data_flash_control_block.status < DATA_FLASH_UPDATE_STATE_FINALIZE_COMPLETED )
            {
                update_dataflash_data_mirror_from_image();
            }
            if (update_data_flash_control_block.status == DATA_FLASH_UPDATE_STATE_ERROR)
            {
                PKCS11_PAL_DEBUG_PRINT(("ERROR: Update data flash data mirror from image\r\n"));
                while(1);
            }
            check_dataflash_area(retry_counter + 1);
        }
    }
    else
    {
        PKCS11_PAL_DEBUG_PRINT(("NG\r\n"));
        PKCS11_PAL_DEBUG_PRINT(("data flash(mirror) hash check...\r\n"));
        mbedtls_sha256_starts_ret(&ctx, 0); /* 0 means SHA256 context */
        mbedtls_sha256_update_ret(&ctx, (unsigned char *)&pkcs_control_block_data_mirror.data, sizeof(pkcs_control_block_data_mirror.data));
        mbedtls_sha256_finish_ret(&ctx, hash_sha256);
        if(!memcmp(pkcs_control_block_data_mirror.hash_sha256, hash_sha256, sizeof(hash_sha256)))
        {
            PKCS11_PAL_DEBUG_PRINT(("OK\r\n"));
            PKCS11_PAL_DEBUG_PRINT(("recover main from mirror.\r\n"));
            memcpy(&pkcs_control_block_data_image, (void *)&pkcs_control_block_data_mirror, sizeof(pkcs_control_block_data_mirror));
            data_flash_update_status_initialize();
            while ( update_data_flash_control_block.status < DATA_FLASH_UPDATE_STATE_FINALIZE_COMPLETED )
            {
                update_dataflash_data_from_image();
            }
            if (update_data_flash_control_block.status == DATA_FLASH_UPDATE_STATE_ERROR)
            {
                PKCS11_PAL_DEBUG_PRINT(("ERROR: Update data flash data from image\r\n"));
                while(1);
            }
            check_dataflash_area(retry_counter + 1);
        }
        else
        {
            PKCS11_PAL_DEBUG_PRINT(("NG\r\n"));
            while(1)
            {
                vTaskDelay(10000);
                PKCS11_PAL_DEBUG_PRINT(("------------------------------------------------\r\n"));
                PKCS11_PAL_DEBUG_PRINT(("Data flash is completely broken.\r\n"));
                PKCS11_PAL_DEBUG_PRINT(("Please erase all code flash.\r\n"));
                PKCS11_PAL_DEBUG_PRINT(("And, write initial firmware using debugger/rom writer.\r\n"));
                PKCS11_PAL_DEBUG_PRINT(("------------------------------------------------\r\n"));
            }
        }
    }
}

void data_flash_update_status_initialize(void)
{
	update_data_flash_control_block.status = DATA_FLASH_UPDATE_STATE_INITIALIZE;
}

void update_data_flash_callback_function(void *event)
{
	uint32_t event_code;
	event_code = *((uint32_t*)event);

	switch(event_code)
	{
		case FLASH_INT_EVENT_ERASE_COMPLETE:
			if(DATA_FLASH_UPDATE_STATE_ERASE_WAIT_COMPLETE == update_data_flash_control_block.status)
			{
				update_data_flash_control_block.status = DATA_FLASH_UPDATE_STATE_WRITE;
			}
			else
			{
				update_data_flash_control_block.status = DATA_FLASH_UPDATE_STATE_ERROR;
			}
			break;
		case FLASH_INT_EVENT_WRITE_COMPLETE:
			if(DATA_FLASH_UPDATE_STATE_WRITE_WAIT_COMPLETE == update_data_flash_control_block.status)
			{

				update_data_flash_control_block.status = DATA_FLASH_UPDATE_STATE_FINALIZE;
			}
			else
			{
				update_data_flash_control_block.status = DATA_FLASH_UPDATE_STATE_ERROR;
			}
			break;
		default:
			break;
	}
}
